In [2]:
%load_ext autoreload
%autoreload 2

In [3]:
import os
import pandas as pd
from dsmlibrary.datanode import DataNode

### Setting

In [4]:
DATAPLATFORM_API_URI = "https://api.discovery.dev.data.storemesh.com"
OBJECT_STORAGE_URI = "dataframe.objectstorage.dev.data.storemesh.com"
token = "eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJ0b2tlbl90eXBlIjoiYWNjZXNzIiwiZXhwIjoxNjcxMDY2MjY1LCJpYXQiOjE2NzA5Nzk4NjUsImp0aSI6Ijk3YjViZTlhYWQzYzQ3OWM4YWMwOGJjYjExNzg5ZDliIiwidXNlcl9pZCI6MTV9.uQWvps715pan6_QcvWCqKDrNPJORtzMmJCoPTkGIn2s"
datanode = DataNode(
        token,
        dataplatform_api_uri=DATAPLATFORM_API_URI,
        object_storage_uri=OBJECT_STORAGE_URI,
    )

Init DataNode sucessful!

In [20]:
ddf_error = datanode.read_ddf(file_id=1846)
df_error = ddf_error.compute()
df_error

,pk,column,input,rule_name,is_required,rule_type
0,system01_3,description,NaN,not_nullable,False,completeness
1,system01_4,description,NaN,not_nullable,False,completeness
2,system02_1,description,NaN,not_nullable,False,completeness
3,system02_2,description,NaN,not_nullable,False,completeness
4,system01_4,unit_price,0.0,"in_range(1, 1000)",True,format

In [26]:
ddf_data1 = datanode.read_ddf(file_id=1571)
df_data1 = ddf_data1.compute()
df_data1

,id,title,unit,unit_price,description
0,system01_1,apple,ลูก,17.0,apple จากสระบุรี หวานอร่อย หอมมัน
1,system01_2,banana,ลูก,9.0,banana จากอยุธยา คัดสรรอย่างดีจากไร่มีชื่อ
2,system01_3,ลองกอง,ลูก,4.0,<NA>
3,system01_4,มังคุด,ลูก,0.0,<NA>

In [27]:
ddf_data1 = datanode.read_ddf(file_id=1572)
df_data1 = ddf_data1.compute()
df_data1

           id   title unit  unit_price
0  system02_1   apple  ลูก        18.0
1  system02_2  banana  ลูก        10.0

In [25]:
ddf_data = datanode.read_ddf(file_id=1573)
df_data = ddf_data.compute()
df_data

,id,title,unit,unit_price,description
0,system01_1,apple,ลูก,17.0,apple จากสระบุรี หวานอร่อย หอมมัน
1,system01_2,banana,ลูก,9.0,banana จากอยุธยา คัดสรรอย่างดีจากไร่มีชื่อ
2,system01_3,ลองกอง,ลูก,4.0,<NA>
0,system02_1,apple,ลูก,18.0,<NA>
1,system02_2,banana,ลูก,10.0,<NA>

In [30]:
1 - 1/6

0.8333333333333334

In [21]:
datanode.writeListFile(
    directory_id=300, 
    file_path="./example.txt", 
    description="dddd", 
    replace=True
)

  0%|          | 0.00/10.0 [00:00<?, ?B/s]

{'status': 'sucess',
 'file_id': 1512,
 'path': 'patcharapon/TC-06_Version4/Staging/example.listFile'}

In [22]:
datanode.get_file_version(file_id=1512)

[{'file_id': 1513, 'timestamp': '2022/11/15 13:16:16'},
 {'file_id': 1511, 'timestamp': '2022/11/15 13:10:26'}]